ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV240/WordFiboClockV240.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino. ...
 Changes V094: Replaced NIMBLE with ESP32 BLE.  ...
 Changes V130: Removed old coding and use NEOPIXEL and use ESPAsyncWebServer. 203222 l/s again instead of 140000. ...
 Changes V199: All Rework in Webpage to CheckWIFIcommand(). 199a Clock logic in ClockLogic.h. Corrected double Menu i and ii on webpage when BLE open.   ...
 Changes V228: Check all clock definitions and corrected error. Added ClearTestStrip().    
 Changes V229: New Name WordFiboClock. Combined WordclockV228 and FibonacciV011. The HC-12 / BLE TimeSender is a new feature (H06). 
 Changes V230: Added Fibo colourpicker. Combined headers. Error with Neopixel wrong pinnumbering.
 Changes V231: Updated comments.      
 Changes V232: Added NOCLOCK. Clockfaces.h,WordClock.h and Fibonacci.h  can be deleted with this option
 Changes V233: Corrected digital clock 
 Changes V234: Added the new RotPressOne/Two/Three entries in all three variant sections.
 Changes V235: Live colour in web menu. log screen wider in main menu
 Changes V236: Added: MQTT CheckMQTT() non-blocking — only runs when Mem.WIFIcredentials == SET_AND_OK and WiFi is actually connected;
 Changes V237: Added: MQTT - HA buttons Y, ~, O, P, @ and Q1-9, Two test sensors: CPU Temperature and LDR Reading, published once/minute. 
               Added: analogWriteResolution(LED_RED, 9); analogWriteFrequency(LED_RED, 5000);  // (same for LED_GREEN, LED_BLUE)
               Added: X in colour when Display is off in HTML menu              
               Added: void InitStatusLEDs(void)
 Changes V238: Make MQTT selectable with Mem.MQTT. Fixed rotary debouncing when no rotary connected
 Changes V239: Default HTML menu page does not zoom in anymore on inputfiled. Removed the auto-focus call — page now opens at the top   
 Changes V240: Cleanup code. MQTT controls added

*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.3.10 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)     -- > with EdsoftLED both can be used
               By GPIO number (legacy)      -- > When using NEOpixel   Adafruit_NeoPixel/esp.c:78:(.text.espShow+0x55): undefined reference to `digitalPinToGPIONumber' when using By Arduino pin
USB mode: Normal (Tiny USB)
**********************
*/
// =============================================================================================================================
// *******  Select below, with only one #define selected, the clock variant *******

// ------------------>   Define only ONE display type below.

#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define UK144CLOCK              // English display for 12 x 12 Front.
//#define FR144CLOCK              // French display for 12 x 12 Front.
//#define DE144CLOCK              // German display for 12 x 12 Front.
//#define NL92CLOCK               // Dutch display for one LED-strip behind every word
//#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L294          // NL clock with four extra LEDs for the minutes to light up
//#define VIERTALENKLOK           // Viertalenklok Ulrich

//   FIBONACCI selects the Fibonacci clock; 
//#define FIBONACCI               // Fibonacci / chrono clock

//   NOCLOCK you can delete Clockfaces.h,WordClock.h and Fibonacci.h 
// #define NOCLOCK
// ------------------>   Derive the build variant from the selection above

//------------------------------------------------------------------------------              //
// ESP32 Definition of installed modules
// The ONEWIRE's are a nice to have options. I leave them as a define for sometime use
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//-------------------------------------------
             #if !defined(FIBONACCI) && !defined(NOCLOCK)
#define WORDCLOCK                                                                             // Any non-Fibonacci, non-NOCLOCK selection is a word clock (uses WordClock.h / ClockFaces.h)
             #endif
             #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (3, 3, 0)                     // Use EdSoftLED with ESP32 compiler.
#define USEEDSOFTLED  // Use EdsoftLED >= V1.10.0 for SK6812. Saves 200-500 bytes compared with NeoPixel. To use NeoPixel is also OK but compile: By GPIO number (legacy)
             #endif
             #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // For LED strip WS2812 or SK6812. https://github.com/ednieuw/EdSoftLED 
             #else
#include <Adafruit_NeoPixel.h> // Compile By GPIO number (legacy) https://github.com/adafruit/Adafruit_NeoPixel
             #endif
//------------------------------------------------------------------------------              //
// Build-environment sanity check - stop the build on an easy-to-miss IDE setting
//--------------------------------------------
             #if !defined(USEEDSOFTLED) && defined(BOARD_HAS_PIN_REMAP)                       // NeoPixel + Tools > Pin Numbering = 'By Arduino pin'
  #error "NeoPixel build with 'Pin Numbering = By Arduino pin'. Set Tools > Pin Numbering to 'By GPIO number (legacy)' (and use GPIO numbers, e.g. LED_PIN = 8) to avoid the 'undefined reference to digitalPinToGPIONumber' link error."
             #endif

#include <Preferences.h>       // For storage
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <esp_sntp.h>          // for NTP
#include <esp_wps.h>           // For WPS
#include <ESPAsyncWebServer.h> // Used for webpage  https://github.com/ESP32Async 
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC. https://github.com/adafruit/RTClib
#include <Encoder.h>           // For rotary encoder. https://github.com/PaulStoffregen/Encoder
#include <Keypad.h>            // For 3x1 membrane keypad by Mark Stanley & Alexander Brevig 
#include <IRremote.hpp>        // IR remote control. https://github.com/Arduino-IRremote/Arduino-IRremote
#include <PubSubClient.h>      // MQTT client, used for Home Assistant discovery. https://github.com/knolleary/pubsubclient PubSubClient3 by Nick O'Leary in library manager

// CLOCK_VARIANT (build name string) is defined per-variant in WordClock.h / Fibonacci.h
//------------------------------------------------------------------------------              //
// SPIFFS storage
//--------------------------------------------
Preferences FLASHSTOR;

