ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV240/WordFiboClockV240.ino
 const char *menusmall[] = {
 "F Own colour (Hex FWWRRGGBB)",
 "I Info menu, II long menu",
 "N Display off between Nhhhh (N2208)",
 "O Display On/Off",
 "Q Display colour choice (Q0)",
 "R Reset settings, @ Restart" };
//  -------------------------------------   End Definitions  ---------------------------------------

// --- Variant code: display layer + colour-picker page + menu page --------- //
// One file per variant (provides Displaytime(), ColourPick_html[], menu_html[]).
#if   defined(WORDCLOCK)
  #include "WordClock.h"                                                                      // WordClock display + picker + menu (-> ClockFaces.h)
#elif defined(FIBONACCI)
  #include "Fibonacci.h"                                                                      // Fibonacci display + picker + menu
#elif defined(NOCLOCK)
  #include "NoClock.h"                                                                        // No display: no-op stubs only (headless BLE/HC-12 build)
#endif

// ===========================================================================
//  TIME SENDER  (HC-12 + BLE SERVER MODE) - shared, runtime-gated by
//  Mem.TimeSender (BLE) and Mem.HC12Time (HC-12). Enable with the H06 command.
// ===========================================================================
static NimBLEServer*           TSpServer           = nullptr;
static NimBLEService*          TSpService          = nullptr;
static NimBLECharacteristic*   TSpTX               = nullptr;
static NimBLECharacteristic*   TSpRX               = nullptr;
static NimBLEAdvertising*      TSpAdvertising      = nullptr;

static bool                    TSClientConnected   = false;
static bool                    TSClientSubscribed  = false;                                    // True once client has enabled notifications (CCCD written)
static bool                    TimeSenderServerRunning = false;
static unsigned long           TSsendDelayms       = 0;
static bool                    TSdatePending       = false;
static uint16_t                TSconnHandle        = 0;
#define UART_SERVICE_UUID        "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define UART_CHARACTERISTIC_RX   "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define UART_CHARACTERISTIC_TX   "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud
 Wire.begin();                                                                                // Maybe not necessary
 int32_t Tick = millis(); 
 InitStorage();                                                                               // Load settings from storage and check validity   
 StartLeds();                                                                                 // Select the SK6812 or WS2812 LED strip and initialysed
 if (NUM_LEDS < 256) ClearTestStrip();                                                        // Testing on a 256-LED strip: blank the surplus LEDs left lit after upload
 InitStatusLEDs();                                                                            // Init status LEDs
 while (!Serial && ( (millis()-Tick) < 2002)) { LEDstartup(green);delay(500); }               // Wait max 1.5 sec to establish serial connection
 SetStatusLED(10,0,10);                                                                       // Set the status LED to red
 while (!Serial && ( (millis()-Tick) < 3000)) { LEDstartup(purple); delay(250); }             // Wait max 3 sec to establish serial connection
 PrintHeaps();                                                                                // Print memory usage  
 LEDstartup(capri); Tekstprintln("Serial started\nStored settings loaded\nLED strip started");// InitStorage and StartLEDs must be called first                                                                   // MCU Restart counter     
 if(++Mem.MCUrestarted>5) { Reset();  ResetCredentials(); }                                   // If the MCU restarts during Setup() so often -> Reset() but no ResetCredentials(); 
 StoreStructInFlashMemory();  
 Tekstprintlnf("Using %s LED library", UsedEDSOFTLED?"EDSOFTLED":"NEOPIXEL");                 // 
 Tekstprintlnf("LED strip is %s", Mem.LEDstrip?"WS2812":"SK6812" );
 if(Mem.TimeInput==1) {LEDstartup(pink);   InitRotaryMod();         Tekstprintln("Rotary started"); }            // Start the Rotary encoder
 if(Mem.TimeInput==2) {LEDstartup(grass);  InitKeypad3x1();         Tekstprintln("Keypad started"); }            // Start the Keypad 3x1 
 if(Mem.TimeInput >2) {LEDstartup(white);  Start_IRreceiver();      Tekstprintln("IRremote started");}           // Start IR remote Mem.TimeInput = 3 or 4                                                                                     
 if(Mem.BLEOn)        {LEDstartup(blue);   StartBLEService();       Tekstprintln("BLE started"); }               // Start BLE service 
 if(Mem.WIFIOn)       {LEDstartup(purple); ConnectWIFI();           Tekstprintln("WIFI started"); }              // Start WIFI and optional NTP if Mem.WIFIOn = 1 
                      {LEDstartup(yellow); InitTimeSystem();        Tekstprintln("Time system started");}        // Initialize RTC + DS3231 sync
 if(Mem.TimeReceiver) {LEDstartup(blue);   StartTimeReceiverScan(); Tekstprintln("Time Receiver started"); } // Time Receiver app on iPhone can be used
 if(Mem.TimeSender)   {LEDstartup(sky);    BLETimeSenderStart();    Tekstprintln("Time Sender started"); }   // Start the BLE TimeSender (H06)
 if(Mem.HC12Time)     {LEDstartup(amber);  InitHC12();              Tekstprintln("HC12 Time started"); }     // Start the HC-12 time sender
 if(Mem.ResetPin)  {LEDstartup(orangered); InitResetpin();          Tekstprintlnf("RST button on GPIO %d started",Mem.ResetPin); } //  
 Previous_LDR_read = ReadLDR();                                                               // Set the initial LDR reading 
 GetTijd(true);                                                                               // Get the time and do not print it
 LEDstartup(green);                                                                           // Set the status LED to green
 StoreStructInFlashMemory();                                                                  // 
 delay(250);
 LEDstartup(CLEARLEDSTARTUP);                                                                 // Erase the startup LEDs from the clock display
 Tekstprintln("Setup finished");
 Tekstprint("Compiled on: "); Tekstprintln(ARDUINO_BOARD);                                    //  #ifdef ARDUINO_BOARD 
 Tekstprintlnf("Software version: %s", SoftwareName());
 Tekstprintlnf("Clock variant: %s",CLOCK_VARIANT);
 SWversion();                                                                                 // Print the menu + version 
 Displaytime(); Tekstprintln("");
 msTick = millis();                                                                           // Start the seconds loop counter
}

//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;
 if (Demo)            Demomode();                                                             // 
 else if(FireDisplay) FireMode();                                                             //
 else                 EverySecondCheck();                                                     // Let the second led tick and run the clock program
 CheckDevices();
}

//--------------------------------------------                                                //
// COMMON Check connected input devices
//--------------------------------------------
void CheckDevices(void)
{
 CheckBLE();                                                                                  // Something with BLE to do?
 SerialCheck();                                                                               // Check serial port every second
 CheckWIFIcommand();                                                                          // Check if there is a command given from the web page
 if(Mem.MQTT) CheckMQTT();                                                                                 // Maintain MQTT connection and publish HA discovery once connected

