ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV240/WordFiboClockV240.ino
 if (Mem.TimeInput==1) RotaryEncoderCheck();
 if (Mem.TimeInput==2) Keypad3x1Check();                                                      // 
 if (Mem.TimeInput==3 || Mem.TimeInput==4) IrReceiverDecode();
 if (ntpJustSynced) CheckandPrintNTPsynced();
                                  #ifdef ONEWIREKEYPAD3x4   
 OnewireKeypad3x4Check(); 
                                  #endif  //ONEWIREKEYPAD3x4
                                  #ifdef ONEWIREKEYPAD3x1   
 OnewireKeypad3x1Check(); 
                                  #endif  //ONEWIREKEYPAD3x1
}
//--------------------------------------------                                                //
// COMMON Update routine 
// Performs tasks every second
//--------------------------------------------
void EverySecondCheck(void)
{
 static bool Toggle = 0;
 uint32_t msLeap = millis() - msTick;
 if (msLeap > 999)                                                                            // Every second enter the loop
  {
   msTick = millis();
   GetTijd(false);                                                                            // Get the time for the seconds
   Toggle = !Toggle;                                                                          // Used to turn On or Off Leds
   UpdateStatusLEDs(Toggle);
   SetSecondColour();                                                                         // Set the colour per second of 'IS' and 'WAS' 
   if(Mem.ResetPin) CheckResetPin();                                                          // Check  reset button
  if (Mem.TimeReceiver) CheckTimeReceiverClient();                                            // Check if a TimeSender is in the air
  if (Mem.TimeSender)   CheckTimeSender();                                                    // H06: push time/date over BLE TimeSender (self-throttled to 10s)
   DimLeds(TestLDR);                                                                          // Every second an intensity check and update from LDR reading
   if (shouldReboot)                                                                          // After finish OTA update restarts after 3 seconds. 1 second is too fastú
     {
      if (MQTTclient.connected()) MQTTclient.publish((MQTTDeviceId() + "/status").c_str(), "offline", true); // Tell HA we are going down instead of waiting for the MQTT timeout
      delay(2000);   ESP.restart();
     }
   if (timeinfo.tm_min != lastminute) EveryMinuteUpdate();                                    // Enter the every minute routine after one minute; 
   Loopcounter=0;
  }  
}

//--------------------------------------------                                                //
// COMMON Update routine done every minute
//-------------------------------------------- 
void EveryMinuteUpdate(void)
{
 lastminute = timeinfo.tm_min;
 if(Mem.HC12Time && Mem.TimeLogPrint == 1) SendHC12TimeString();                              // HC-12 broadcast per minute (K1). K2 = per hour, K0 = off
 if (Mem.RandomDisplay == 1) { ChangeRandomDisplay(); SetSecondColour();} 
 if (IR_PowerOnstate && ((millis() - IR_StartTime) > 290000) ) ToggleIRpower();               // Turn off IR Power after 300 seconds 
 CheckMCURestartCounter();                                                                    // MCUrestarted reset-window. Checks if startup went well
 //GetTijd(false);
 bool ff = NoTextInLeds;
 if (Mem.TimeLogPrint == 0 || Mem.TimeLogPrint == 2)                                          // Do not print time but do update the display                                                              // do not Print the time string every minute
    { NoTextInLeds = true; DimLeds(false);  Displaytime();   }
 if (Mem.TimeLogPrint == 1)                                                                   // Print the time string every minute
    { NoTextInLeds = false; DimLeds(true); Displaytime();  Tekstprintln(""); }
 NoTextInLeds = ff;   
 PublishCPUTemperature();                                                                   // TEST: publish CPU temperature to MQTT every minute
 PublishLDRreading();                                                                       // TEST: publish LDR reading to MQTT every minute
 PublishDisplayChoiceState();                                                               // Keep the HA select entity in sync with Mem.DisplayChoice
 PublishMQTTStates();                                                                       // Keep the other HA entities (switch, selects, diagnostics) in sync
 
 if(timeinfo.tm_hour != lasthour) EveryHourUpdate();
}
//--------------------------------------------                                                //
// COMMON Update routine done every hour
//--------------------------------------------
void EveryHourUpdate(void)
{
 lasthour = timeinfo.tm_hour;
 if(Mem.HC12Time && Mem.TimeLogPrint == 2) SendHC12TimeString();                              // HC-12 broadcast per hour (K2). K1 = per minute, K0 = off
 if (!Mem.StatusLEDOn) SetStatusLED(0,0,0);                                                   // If for some reason the LEDs are ON and after a MCU restart turn them off.
 bool ff = NoTextInLeds; 
if (Mem.TimeLogPrint == 0 )                                                                   // Do not print time but do update the display                                                              // do not Print the time string every minute
    { NoTextInLeds = true; DimLeds(false);  Displaytime();   }
 if (Mem.TimeLogPrint == 2)                                                                   // Print the time string every hour
    { NoTextInLeds = false; DimLeds(true);  Displaytime();    Tekstprintln(""); }           
 if ((timeinfo.tm_hour == Mem.TurnOffLEDsAtHH) && (Mem.TurnOffLEDsAtHH != Mem.TurnOnLEDsAtHH))
    { LEDsAreOff = true;  ClearScreen(); }                                                    // Is it time to turn off the LEDs?
 if (timeinfo.tm_hour == Mem.TurnOnLEDsAtHH)
    { LEDsAreOff = false;   lastminute = 99;     Displaytime(); Tekstprintln("");}            // Force a minute update
 CheckRestoreWIFIconnectivity();                                                              // Check if WIFI is still connected and if not restore it
 Mem.NVRAMmem[lasthour] = NoofLDRreadshour ? (byte)(SumLDRreadshour / NoofLDRreadshour) : 0;  // Update the average LDR readings per hour. Avoids dividing by zero
 SumLDRreadshour  = 0;
 NoofLDRreadshour = 0;
 if (Mem.RandomDisplay == 2) { ChangeRandomDisplay(); SetSecondColour();}                     // If RandomDisplay is ON change the display choice
 NoTextInLeds = ff;  
 if (timeinfo.tm_mday != lastday) EveryDayUpdate();  
}
//--------------------------------------------                                                //
// COMMON Update routine done every day
//--------------------------------------------
void EveryDayUpdate(void)
{
 lastday           = timeinfo.tm_mday; 
 Previous_LDR_read = ReadLDR();                                                               // To have a start value and reset the Min Max measurements 
 MinPhotocell      = Previous_LDR_read;                                                       // Stores minimum reading of photocell;
 MaxPhotocell      = Previous_LDR_read;                                                       // Stores maximum reading of photocell;                                 
 Tekstprintln(PrintRTCTime());                                                                // Print time as dd-mmm-yy hh:mm:ss
 StoreStructInFlashMemory();                                                                  // Update Mem struct once a day to store Mem.NVRAM measurements
}
//--------------------------------------------                                                //
// COMMON Init status LEDs
//-------------------------------------------- 
void InitStatusLEDs(void)
{
 analogWriteResolution(LED_RED,   9);                                                         // Pin resolution/frequency explicitly, before the first analogWrite() on these pins -
 analogWriteResolution(LED_GREEN, 9);                                                         // 9-bit (max 511) matches SetStatusLED()'s own 0-512 intensity scale directly, and the
 analogWriteResolution(LED_BLUE,  9);                                                         // core's implicit default for this has already silently changed across ESP32 core versions once before
 analogWriteFrequency(LED_RED,   5000);
 analogWriteFrequency(LED_GREEN, 5000);
 analogWriteFrequency(LED_BLUE,  5000);
 SetStatusLED(0,10,0);                                                                        // Set to green
 }

//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(bool Toggle)
{
 if(Mem.StatusLEDOn)   
   {
    if (Toggle) SetStatusLED(( WiFi.localIP()[0]==0) * 20,                                    // no WIFI on 
                              (WiFi.localIP()[0]!=0) * 20,                                    // WIFI on
                              (BLEConnected)         * 20);                                   // BLE on
    else        SetStatusLED((TRConnected) * 20, (TRConnected) * 20, 0);                      // If TimeRreceiver Connected then Yellow = Red+Green                               
    SetPCBLED09(  Toggle * 10);                                                               // Left LED
    SetPCBLED10((!Toggle) * 10);                                                              // Right LED
    SetNanoLED13((!Toggle) * (!Mem.UseDS3231 * 50));                                          // LED on ESP32 board. IF DS3231 in use then it is off
   }
else                                                                                          // Turn off all LEDs
   {
    SetStatusLED(0,0,0);                  
    SetPCBLED09(0);                                                                           //
    SetPCBLED10(0);                                                                           //
    SetNanoLED13(0);      
   }
}
//--------------------------------------------                                                //
// COMMON Control the RGB LEDs on the Nano ESP32
// Analog range 0 - 511. 0 is LED Off, 511 is max intensity
// Resolution is pinned to 9-bit in setup() (analogWriteResolution) to match this scale directly,
// regardless of the core's own implicit default, which has shifted across ESP32 core versions before.
//--------------------------------------------
void SetStatusLED(int Red, int Green, int Blue)
{
 analogWrite(LED_RED,   511 - Red);
 analogWrite(LED_GREEN, 511 - Green);
 analogWrite(LED_BLUE,  511 - Blue);
}
//--------------------------------------------                                                //
// COMMON Control orange LED D13 on the Arduino 
//--------------------------------------------
void SetNanoLED13(int intensity) {analogWrite(secondsPin, intensity);}
//--------------------------------------------                                                //
// COMMON Control the RGB LED on the PCB
//--------------------------------------------
void SetPCBLED09(int intensity) {analogWrite(PCB_LED_D09, intensity);}
void SetPCBLED10(int intensity) {analogWrite(PCB_LED_D10, intensity);}

//--------------------------------------------                                                //
// COMMON check for serial input
//--------------------------------------------
void SerialCheck(void)
{
 String SerialString; 
 while (Serial.available())
    { 
     char c = Serial.read();                                                                  // Serial.write(c);
     if (c>31 && c<128) SerialString += c;                                                    // Allow input from Space - Del
     else c = 0;                                                                              // Delete a CR
    }
 if (SerialString.length()>0) 
    {
     ReworkInputString(SerialString);                                                         // Rework ReworkInputString();
     SerialString = "";
    }
}

//--------------------------------------------                                                //
// COMMON Initialyse Resetpin when installed
// Restarting the Arduino 5 times in the hour also resets de settings to default or Rotary press 9 times
//--------------------------------------------
void InitResetpin(void)
{
  if(Mem.ResetPin) pinMode(Mem.ResetPin, INPUT_PULLUP);                                       // Pull RST_PIN pin high if pin >0  
}
//--------------------------------------------
// COMMON  Check reset button on RST_PIN (D6)
// Triggers Reset() and ResetCredentials(); when held LOW for >= 2 seconds.
// Called once per second from EverySecondCheck().
//--------------------------------------------
void CheckResetPin(void)
{
 if(!Mem.ResetPin)  return;                                                                   // if(Mem.ResetPin)==0 then no resetpin
 static uint8_t PressedSeconds = 0;
 if (digitalRead(RST_PIN) == HIGH) {PressedSeconds = 0; return;}                              // Button not pressed
 if (++PressedSeconds >= 2)
  {
   Tekstprintln("Reset pressed. Settings to Factory default. Restarting");   
   Reset();
   ResetCredentials();
   shouldReboot = true;                                                                       // Causes ESP.restart(); 
  }
}

//--------------------------------------------                                                //
// COMMON Reset to default settings. BLE On, WIFI NTP Off
//--------------------------------------------
void Reset(void)
{
 Mem.Checksum         = 25065;                                                                // Check number control validity of the struct
 Mem.DisplayChoice    = DEFAULTCOLOUR;                                                        // Default colour scheme 
 Mem.OwnColour        = green;                                                                // Own designed colour.
 Mem.DimmedLetter     = black;                                                                // LEDs are Off
 Mem.BackGround       = black;                                                                // LEDs are Off
 Mem.LanguageChoice   = 0;                                                                    // 0 = NL, 1 = UK, 2 = DE, 3 = FR, 4 = Wheel
 Mem.LightReducer     = SLOPEBRIGHTNESS;                                                      // Factor to dim ledintensity with. Between 0.1 and 1 in steps of 0.05
 Mem.UpperBrightness  = MAXBRIGHTNESS;                                                        // Upper limit of Brightness in bits ( 1 - 255)
 Mem.LowerBrightness  = LOWBRIGHTNESS;                                                        // Lower limit of Brightness in bits ( 0 - 255)
 Mem.TurnOffLEDsAtHH  = 0;                                                                    // Display Off at nn hour
 Mem.TurnOnLEDsAtHH   = 0;                                                                    // Display On at nn hour Not Used
 Mem.TimeLogPrint     = 0;                                                                    // Print time per minute (1) or hour (2)
 Mem.HetIsWasOff      = 0;                                                                    // Turn On or Off HET IS WAS   
 Mem.EdSoftLEDSOn     = 0;                                                                    // Turn On or Off EDSOFT LEDs
 Mem.RandomDisplay    = 0;                                                                    // Choose every minute/hour another display
 Mem.WIFInoConnection = 0;                                                                    // Will store the no of reboots
 Mem.TimeReceiver     = 0;                                                                    // Use Time Sender app to set time 
 Mem.TimeSender       = 0;                                                                    // Turn this device on as time sender Code in ESP32Communications.ino sketch
 Mem.Ringbufcnt       = 0;                                                                    // Display the ringbuffer counter in the logging
 Mem.HC12Time         = 0;                                                                    // Use HC12 timesender
 Mem.ResetPin         = RST_PIN;                                                              // Use a Reset button on D2 or D6
 Mem.byteFuture1      = 0;                                                                    // For future use
 Mem.byteFuture2      = 0;                                                                    // For future use
 Mem.MQTT             = 0;                                                                    // Turn On or Off MQTT 
 Mem.IntFuture2       = 0;                                                                    // For future use
 Mem.BLEOn            = 1;                                                                    // default BLE On
 Mem.UseBLELongString = 0;                                                                    // Default off. works only with iPhone/iPad with BLEserial app
 Mem.NTPOn            = 1;                                                                    // NTP default On
 Mem.WIFIOn           = 1;                                                                    // WIFI default On
 Mem.MCUrestarted     = 0;                                                                    // MCU Restarts during Setup() counter caused by unknown errors during startup
 Mem.LoopRebooted     = 0;                                                                    // Reboots caused by less than 10 loops /second. Program hangs or severly delayed
 Mem.WIFIcredentials  = NOT_SET;                                                              // Status of the WIFI connection
 //Mem.TimeInput      = 0;    // Do not erase this setting with a reset                       // Use the rotary coding
 Mem.DCF77On          = 0;                                                                    // Default off
 Mem.UseDS3231        = 0;                                                                    // Default off
 //Mem.LEDstrip       = 0;    // Do not erase this setting with a reset                       // 0 = SK6812, 1=WS2812
 Mem.ColourNL         = 0x00FFFFFF;                                                           // Self defined NL colour for clock display
 Mem.ColourUK         = 0x0000FF00;                                                           // Self defined UK colour for clock display
 Mem.ColourDE         = 0x00FFFF00;                                                           // Self defined DE colour for clock display
 Mem.ColourFR         = 0x00FF0000;                                                           // Self defined FR colour for clock display 
 Previous_LDR_read    = ReadLDR();                                                            // Read LDR to have a start value. max = 4096/8 = 255
 MinPhotocell         = Previous_LDR_read;                                                    // Stores minimum reading of photocell;
 MaxPhotocell         = Previous_LDR_read;                                                    // Stores maximum reading of photocell;                                            
 TestLDR              = 0;                                                                    // If true LDR display is printed every second
 for (int i = 0; i < NOOFBUTTONS; i++)  IRMem.buttons[i].learned = 0;
 for (int i = 0; i < 24         ; i++)           Mem.NVRAMmem[i] = 0;
 Tekstprintln("**** Reset of preferences ****"); 
 StoreStructInFlashMemory();                                                                  // Update Mem struct      
 GetTijd(false);                                                                              // Get the time and store it in the proper variables
 SWversion();                                                                                 // Display the version number of the software
 Displaytime();Tekstprintln("");
}
//--------------------------------------------                                                //
// COMMON Reset to empty credential settings WIFI, NTP, BLE ON
//--------------------------------------------
void ResetCredentials(void)
{
 strcpy(Mem.SSID,"");                                                                         // Default SSID
 strcpy(Mem.Password,"");                                                                     // Default password
 strcpy(Mem.BLEbroadcastName,"WordClock");
 strcpy(Mem.Timezone,"CET-1CEST,M3.5.0,M10.5.0/3");                                           // Central Europe, Amsterdam, Berlin etc.
 Mem.WIFIcredentials  = 0;                                                                    // Status of the WIFI connection  
 Mem.WIFIOn           = 1;                                                                    // WIFI on
 Mem.NTPOn            = 1;
 Mem.BLEOn            = 1;                                                                    // default BLE On
 StoreStructInFlashMemory();                                                                  // Update Mem struct   
}
//--------------------------------------------                                                //
// COMMON common print routines
// %s - String
// %d - Integer (decimal)
// %04X - Hex with 4 digits, uppercase, leading zeros
// %08X - Hex with 8 digits, uppercase, leading zeros
// PRIX32 - 32-bit hex for uint32_t values
//--------------------------------------------
void Tekstprint(char const *tekst)    { if(Serial) Serial.print(tekst); SendMessageTimeReceiver(tekst); SendMessageBLE(tekst); AddLog(tekst);}  
void Tekstprintln(char const *tekst)  { snprintf(sptext, sizeof(sptext),"%s\n",tekst); Tekstprint(sptext); }
void TekstSprint(char const *tekst)   { printf(tekst); }                                      // printing for Debugging purposes in serial monitor 
void TekstSprintln(char const *tekst) { snprintf(sptext, sizeof(sptext),"%s\n",tekst); TekstSprint(sptext); }

//--------------------------------------------                                                //
// COMMON Formatted Tekst print
// Usage: Tekstprintlnf("Log buffer allocated: %u bytes", (unsigned) LogBufferSize);
//--------------------------------------------
void Tekstprintf(const char* fmt, ...) 
{ char Textbuf[256];
 va_list args; va_start(args, fmt); vsnprintf(Textbuf, sizeof(Textbuf), fmt, args); va_end(args);
 Tekstprint(Textbuf);
}
//--------------------------------------------                                                //
// COMMON Formatted Tekstprintln
// Usage: Tekstprintf("Log buffer allocated: %u bytes", (unsigned) LogBufferSize);
//--------------------------------------------
void Tekstprintlnf(const char* fmt, ...) 
{ char Textbuf[256];
 va_list args; va_start(args, fmt); vsnprintf(Textbuf, sizeof(Textbuf), fmt, args); va_end(args);
 Tekstprintln(Textbuf);
}

