ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV240/WordFiboClockV240.ino
class MyCallbacks: public NimBLECharacteristicCallbacks 
{
 void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override  
  {
   std::string rxValue = pCharacteristic->getValue();
   ReceivedMessageBLE = rxValue + "\n";
  }  
};

//--------------------------------------------                                                //
// BLE Start BLE Service
//--------------------------------------------
void StartBLEService(void)
{
 NimBLEDevice::init(Mem.BLEbroadcastName);
 pServer = NimBLEDevice::createServer();
 pServer->setCallbacks(new MyServerCallbacks());
 BLEService *pService = pServer->createService(SERVICE_UUID);
 pTxCharacteristic = pService->createCharacteristic(
        CHARACTERISTIC_UUID_TX, NIMBLE_PROPERTY::NOTIFY);
 BLECharacteristic *pRxCharacteristic = pService->createCharacteristic(
        CHARACTERISTIC_UUID_RX, NIMBLE_PROPERTY::WRITE);
 pRxCharacteristic->setCallbacks(new MyCallbacks());
 NimBLEAdvertising *pAdvertising = NimBLEDevice::getAdvertising();                            // Configure advertising AFTER server start
 pAdvertising->addServiceUUID(SERVICE_UUID);
 NimBLEAdvertisementData scanResponse;                                                        // Scan response needed for Android (Samsung) to find device in BLE scan
 scanResponse.setName(Mem.BLEbroadcastName);
 pAdvertising->setScanResponseData(scanResponse);
 pAdvertising->start();
 TekstSprint("BLE Waiting a client connection to notify ...\n");
}

//--------------------------------------------                                                //
// BLE Disconnect BLE Service
// NimBLE's built-in disconnect (higher level)
//--------------------------------------------
void DisconnectBLE(void)
{
 auto* server = NimBLEDevice::getServer();
 if (server)
   {
    auto connHandles = server->getPeerDevices();                                              // Get actual connection handles (not index)
    if (!connHandles.empty())
      {
       pServer->disconnect(connHandles[0]);
      }
    BLEConnectedSince = 0;
   }
}
//--------------------------------------------                                                //
// BLE CheckBLE input and rework string
// After 1/4 hour the BLE connection is disconnected
//--------------------------------------------
void CheckBLE(void)
{
 if (BLEConnected && !oldBLEConnected) 
   {
    oldBLEConnected = BLEConnected;
    BLEConnectedSince = millis();                                                             // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
   }
 if (!BLEConnected && oldBLEConnected)                                                        // If device is disconnected start advertising
   {
    delay(300);
    pServer->startAdvertising();
    TekstSprint("Start advertising\n");
    oldBLEConnected = BLEConnected;
    BLEConnectedSince = 0;                                                                    // Reset BLE connection timer
   }
 if ((BLEConnected && BLEConnectedSince > 0) && (millis() - BLEConnectedSince > 900000))      // Disconnect if connected longer than 15 minutes inactivity 
   {
    auto connHandles = NimBLEDevice::getServer()->getPeerDevices();                           // Vector of uint16_t handles
    if (!connHandles.empty()) 
      {
       pServer->disconnect(connHandles[0]);
       TekstSprint("Disconnected BLE client after 1/4 hour\n");
       BLEConnectedSince = 0;
      }
    }
 if(ReceivedMessageBLE.length()>0)
   {
    SendMessageBLE(ReceivedMessageBLE);
    String BLEtext = ReceivedMessageBLE.c_str();
    ReceivedMessageBLE = "";
    ReworkInputString(BLEtext); 
    BLEConnectedSince = millis();                                                             // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
   }
}

//--------------------------------------------                                                //
// TIMESENDER Characteristic callbacks - fires when client subscribes/unsubscribes
//--------------------------------------------
class TSCharCallbacks : public NimBLECharacteristicCallbacks
{
 void onSubscribe(NimBLECharacteristic* pChar, NimBLEConnInfo& connInfo, uint16_t subValue) override
  {
   TSClientSubscribed = (subValue > 0);                                                       // subValue 1=notify, 2=indicate, 0=unsubscribed
  }
};
//--------------------------------------------
class TSServerCallbacks : public NimBLEServerCallbacks
{
void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override
  {
   TSClientConnected = true;
   TSconnHandle      = connInfo.getConnHandle();
   TSsendDelayms     = millis() - 10001;                                                       // Trigger first send immediately after delay
   TSdatePending     = false;
   Tekstprintln("TimeSender client connected");
  }
 void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override
   {
    TSClientConnected  = false;
    TSClientSubscribed = false;
    TSconnHandle = 0;
    Tekstprintln("TimeSender client disconnected");
    NimBLEDevice::startAdvertising();
   }
};
//--------------------------------------------                                                //
// TIMESENDER Time Sender Start
//--------------------------------------------
void BLETimeSenderStart(void)
{
  if(TimeSenderServerRunning) return;
  NimBLEDevice::init(TIMESENDER_DEVICE_NAME);
  TSpServer = NimBLEDevice::createServer();
  TSpServer->setCallbacks(new TSServerCallbacks());
  TSpService = TSpServer->createService(UART_SERVICE_UUID);
  TSpTX = TSpService->createCharacteristic(UART_CHARACTERISTIC_TX, NIMBLE_PROPERTY::NOTIFY);
  TSpTX->setCallbacks(new TSCharCallbacks());                                                 // Track when client subscribes to notifications
  TSpRX = TSpService->createCharacteristic(UART_CHARACTERISTIC_RX, NIMBLE_PROPERTY::WRITE);
  TSpAdvertising = NimBLEDevice::getAdvertising();
  TSpAdvertising->addServiceUUID(UART_SERVICE_UUID);
  TSpAdvertising->start();
  TimeSenderServerRunning = true;
}
//--------------------------------------------                                                //
// TIMESENDER Time Sender Stop
//--------------------------------------------
void BLETimeSenderStop(void)
{
 if(!TimeSenderServerRunning) return;
 if(TSpAdvertising) TSpAdvertising->stop();
 if(TSpServer && TSClientConnected) { TSpServer->disconnect(TSconnHandle);  }
 NimBLEDevice::deinit(true);
 TimeSenderServerRunning = false;
 TSClientConnected = false;
 TSconnHandle      = 0;
}
//--------------------------------------------                                                //
// TIMESENDER Time Sender Send Time and Date
//--------------------------------------------
void CheckTimeSender(void)
{
 if(!TimeSenderServerRunning) return;
 if(!TSClientConnected) return;
 if(!TSClientSubscribed) return;                                                               // Wait until client has subscribed to notifications (CCCD enabled)
 GetTijd(false);
 int h  = timeinfo.tm_hour;
 int m  = timeinfo.tm_min;
 int s  = timeinfo.tm_sec;
 int d  = timeinfo.tm_mday;
 int mo = timeinfo.tm_mon + 1;
 int y  = timeinfo.tm_year + 1900;

 bool sendNow = (millis() - TSsendDelayms >= 10000);

 if(sendNow)
   {
    char buffer[16];
    snprintf(buffer, sizeof(buffer),"T%02d%02d%02d", h, m, s);
    Tekstprintlnf("Sending TIME: %s", buffer);
    TSpTX->setValue((uint8_t*)buffer, strlen(buffer));
    TSpTX->notify();
    TSsendDelayms = millis();
    TSdatePending = true;
   }

 if(TSdatePending && (millis() - TSsendDelayms > 1000))
   {
    char buffer[20];
    snprintf(buffer, sizeof(buffer), "D%02d%02d%04d", d, mo, (uint16_t)y);
    Tekstprintlnf("Sending DATE: D%02d%02d%04d", d, mo, y);
    TSpTX->setValue((uint8_t*)buffer, strlen(buffer));
    TSpTX->notify();
    TSdatePending = false;
   }
}

//--------------------------------------------                                                //
// HC12 Initialyse HC12 serial connection
//--------------------------------------------
void InitHC12(void)
{
  Serial1.begin(9600, SERIAL_8N1, -1, HC12_TX);                                               // -1 = no RX
}
//--------------------------------------------                                                //
// HC12 Send time via HC-12 half-duplex wireless serial communication module
//--------------------------------------------
void SendHC12TimeString(void)
{
  char TimeStr[20];
  sprintf(TimeStr, "T%02d%02d%02d\n", timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
  Serial1.print(TimeStr);
  Tekstprintf("HC-12 time sent: %s",TimeStr);
}

// ============================================================================
// TimeReceiver.h  -  BLE TimeReceiver client (NimBLE-Arduino v2.x)
// Connects to a TimeSender peripheral advertising TIMESENDER_DEVICE_NAME.
//--------------------------------------------                                  //
// BLE TimeReceiver RX notify callback
//--------------------------------------------
static void TimeReceiverNotifyCB(NimBLERemoteCharacteristic*, uint8_t* data, size_t len, bool notify)
{
 static char buf[128];
 size_t n = (len < sizeof(buf) - 1) ? len : sizeof(buf) - 1;
 memcpy(buf, data, n);
 buf[n] = 0;
 ReworkInputString(String(buf));
 TRConnectedSince = millis();
}

