ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV240/WordFiboClockV240.ino
//--------------------------------------------                                                //
// MQTT Check connection and maintain the MQTT client (non-blocking)
//--------------------------------------------
void CheckMQTT(void)
{
 if (!Mem.MQTT) return; 
 if (Mem.WIFIcredentials != SET_AND_OK || WiFi.status() != WL_CONNECTED) return;              // Only try when WIFI is connected and confirmed working
 if (millis() - MQTTlastLoopCall < 25) return;                                                // connected()/loop() both touch the TCP socket - throttle to ~40x/sec instead of every loop() pass
 MQTTlastLoopCall = millis();
 if (!MQTTclient.connected())
   {
    MQTTdiscoveryPublished = false;                                                           // Force a fresh discovery publish after the next successful connect
    if (millis() - MQTTlastAttempt < 5000) return;                                            // Do not block the loop, retry every 5 sec
    MQTTlastAttempt = millis();
    MQTTclient.setServer(MQTT_SERVER, MQTT_PORT);
    MQTTclient.setBufferSize(1024);                                                           // Default 256 bytes is too small for the HA discovery JSON; the "select" entity's 10-option list alone needs ~514 bytes total packet size
    MQTTclient.setCallback(MQTTCallback);
    Tekstprintln("[MQTT] Connecting...");
    String statusTopic = MQTTDeviceId() + "/status";                                          // Availability topic: broker publishes "offline" (the Last Will) when the clock drops off
    if (MQTTclient.connect(Mem.BLEbroadcastName, MQTT_USER, MQTT_PASSWORD, statusTopic.c_str(), 0, true, "offline"))
      {
       Tekstprintln("[MQTT] Connected");
       MQTTclient.publish(statusTopic.c_str(), "online", true);                               // Mark the device available again
       MQTTclient.subscribe((MQTTDeviceId() + "/cmnd").c_str());                              // HA buttons/switches publish their command here
       publishMQTTDiscovery();
       PublishMQTTStates();                                                                   // Publish all states right away so HA entities are not 'unknown' until the next minute
       PublishDisplayChoiceState();
       PublishDisplayChoiceState();                                                           // Report current state right away, not up to a minute later
      }
    else
      {
       Tekstprintlnf("[MQTT] Connect failed, rc=%d", MQTTclient.state());
      }
    return;
   }
 MQTTclient.loop();
}

//--------------------------------------------                                                //
// MQTT Sanitize BLEbroadcastName for use in topic strings (no spaces/slashes)
//--------------------------------------------
String MQTTDeviceId(void)
{
 String deviceId = String(Mem.BLEbroadcastName);
 deviceId.replace(" ", "_");
 deviceId.replace("/", "_");
 deviceId.toLowerCase();
 return deviceId;
}

//--------------------------------------------                                                //
// MQTT Call once after MQTT connects successfully, but only if WIFI credentials are valid
//--------------------------------------------
void publishMQTTDiscovery(void)
{
 if (Mem.WIFIcredentials != SET_AND_OK || MQTTdiscoveryPublished) return;

 String deviceId  = MQTTDeviceId();
 String baseTopic = deviceId;                                                                 // e.g. "wordclock_livingroom"

 publishDiscoverySensor(deviceId, "cputemp", "CPU Temperature", baseTopic + "/cputemp", "\xC2\xB0" "C", "temperature", false); // CPU Temperature sensor
 publishDiscoverySensor(deviceId, "ldr",     "LDR Reading",     baseTopic + "/ldr",     "",               "",         false); // Raw LDR reading, no unit/device class
 publishDiscoverySensor(deviceId, "rssi",    "WiFi Signal",     baseTopic + "/rssi",    "dBm", "signal_strength",     true);  // WiFi signal strength; graph shows if dropouts are router or clock
 publishDiscoverySensor(deviceId, "uptime",  "Uptime",          baseTopic + "/uptime",  "min", "duration",            true);  // Minutes since last (re)boot
 publishDiscoverySensor(deviceId, "freeheap","Free Heap",       baseTopic + "/freeheap","B",   "data_size",           true);  // Free RAM; a sinking graph reveals memory leaks
 publishDiscoverySensor(deviceId, "mcurestarts",  "MCU Restarts",       baseTopic + "/mcurestarts",  "", "",          true);  // Mem.MCUrestarted - restarts during setup()
 publishDiscoverySensor(deviceId, "wifireboots",  "WiFi Reboots",       baseTopic + "/wifireboots",  "", "",          true);  // Mem.WIFInoConnection - reboots after 30h without IP
 publishDiscoverySensor(deviceId, "looprestarts", "Loop-stall Reboots", baseTopic + "/looprestarts", "", "",          true);  // Mem.LoopRebooted - reboots after a starving main loop
 if (DS3231Installed)
    publishDiscoverySensor(deviceId, "ds3231temp", "DS3231 Temperature", baseTopic + "/ds3231temp", "\xC2\xB0" "C", "temperature", false); // Temperature register of the DS3231 RTC module

 String cmndTopic = baseTopic + "/cmnd";                                                      // Shared command topic - every button/switch publishes its single-letter command here
 publishDiscoveryButton(deviceId, "ledtest",        "LED Test",          cmndTopic, "Y"); // Runs the existing LEDtest() command as a proof that MQTT commands reach ReworkInputString()
 publishDiscoveryButton(deviceId, "statusledonoff", "StatusLED On/Off",  cmndTopic, "P"); // Toggles Mem.StatusLEDOn
 publishDiscoveryButton(deviceId, "restart",        "Restart",           cmndTopic, "@"); // Reboots the ESP32

 MQTTclient.publish(("homeassistant/button/" + deviceId + "/displayonoff/config").c_str(),  "", true); // Delete the retained configs of the old buttons,
 MQTTclient.publish(("homeassistant/button/" + deviceId + "/randomdisplay/config").c_str(), "", true); // now replaced by the switch and select below

 publishDiscoverySwitch(deviceId, "display", "Display", cmndTopic, baseTopic + "/display", "O1", "O0");                       // Switch with state: HA sees whether the display is on
 publishDiscoveryNumber(deviceId, "maxbrightness", "Max Brightness", cmndTopic, baseTopic + "/maxbrightness", 1, 255, "M{{ value }}"); // Slider for Mem.UpperBrightness (menu option M)

 publishDiscoverySelect(deviceId, "displaychoice", "Display Colour Scheme", cmndTopic, baseTopic + "/displaychoice", QchoiceNames, LASTITEM + 1); // Q0-Q9 colour scheme picker
 publishDiscoverySelect(deviceId, "randomdisplay", "Random Display",        cmndTopic, baseTopic + "/randomdisplay", RandomChoiceNames, 3);       // Off / per minute / per hour (~0 ~1 ~2)

 MQTTdiscoveryPublished = true;
}

//--------------------------------------------                                                //
// MQTT Generic helper: publishes one MQTT Discovery config for a button.
// The button always sends payloadPress to commandTopic, which MQTTCallback() forwards straight into ReworkInputString() -
// the same single-letter command parser already used by BLE/Serial/the web page.
//--------------------------------------------
void publishDiscoveryButton(String deviceId, String buttonKey, String friendlyName, String commandTopic, String payloadPress)
{
 String configTopic = "homeassistant/button/" + deviceId + "/" + buttonKey + "/config";
 String uniqueId    = deviceId + "_" + buttonKey;

 String payload  = "{";
 payload += "\"name\":\""          + friendlyName  + "\",";
 payload += "\"command_topic\":\""+ commandTopic  + "\",";
 payload += "\"payload_press\":\""+ payloadPress  + "\",";
 payload += "\"availability_topic\":\"" + deviceId + "/status\",";                            // Entity shows 'unavailable' when the clock is offline (Last Will)
 payload += "\"unique_id\":\""     + uniqueId      + "\",";
 payload += "\"device\":{";
 payload +=   "\"identifiers\":[\"" + deviceId + "\"],";
 payload +=   "\"name\":\""         + String(Mem.BLEbroadcastName) + "\",";
 payload +=   "\"manufacturer\":\"EdNieuw\",";
 payload +=   "\"model\":\"WordClock\"";
 payload += "}}";

 bool ok = MQTTclient.publish(configTopic.c_str(), payload.c_str(), true);
 Tekstprintlnf("[MQTT] Discovery publish %s (%u bytes): %s", ok ? "OK" : "FAILED - packet too big for MQTT buffer?", payload.length(), configTopic.c_str());
}

//--------------------------------------------                                                //
// MQTT Generic helper: publishes one MQTT Discovery config for a select (dropdown of options).
// optionNames is any list of friendly names (e.g. QchoiceNames[] or RandomChoiceNames[]) -
// HA sends the chosen name back on commandTopic; MQTTCallback() maps it back to a command for ReworkInputString().
//--------------------------------------------
void publishDiscoverySelect(String deviceId, String selectKey, String friendlyName, String commandTopic, String stateTopic, const char* const optionNames[], byte optionCount)
{
 String configTopic = "homeassistant/select/" + deviceId + "/" + selectKey + "/config";
 String uniqueId    = deviceId + "_" + selectKey;

