ednieuw/Arduino-ESP32-Nano-Wordclock/WordFiboClockV240/WordFiboClockV240.ino
 String options = "[";
 for (byte i = 0; i < optionCount; i++) { if (i) options += ","; options += "\"" + String(optionNames[i]) + "\""; }
 options += "]";

 String payload  = "{";
 payload += "\"name\":\""          + friendlyName + "\",";
 payload += "\"command_topic\":\""+ commandTopic  + "\",";
 payload += "\"state_topic\":\""  + stateTopic    + "\",";
 payload += "\"options\":"        + options       + ",";
 payload += "\"availability_topic\":\"" + deviceId + "/status\",";                            // Entity shows 'unavailable' when the clock is offline (Last Will)
 payload += "\"unique_id\":\""     + uniqueId      + "\",";
 payload += "\"device\":{";
 payload +=   "\"identifiers\":[\"" + deviceId + "\"],";
 payload +=   "\"name\":\""         + String(Mem.BLEbroadcastName) + "\",";
 payload +=   "\"manufacturer\":\"EdNieuw\",";
 payload +=   "\"model\":\"WordClock\"";
 payload += "}}";

 bool ok = MQTTclient.publish(configTopic.c_str(), payload.c_str(), true);
 Tekstprintlnf("[MQTT] Discovery publish %s (%u bytes): %s", ok ? "OK" : "FAILED - packet too big for MQTT buffer?", payload.length(), configTopic.c_str());
}

//--------------------------------------------                                                //
// MQTT Generic helper: publishes one MQTT Discovery config for a switch (on/off with state).
// HA sends payloadOn/payloadOff to commandTopic (existing single-letter commands); the clock
// reports the real state on stateTopic ("ON"/"OFF") via PublishMQTTStates().
//--------------------------------------------
void publishDiscoverySwitch(String deviceId, String switchKey, String friendlyName, String commandTopic, String stateTopic, String payloadOn, String payloadOff)
{
 String configTopic = "homeassistant/switch/" + deviceId + "/" + switchKey + "/config";
 String uniqueId    = deviceId + "_" + switchKey;

 String payload  = "{";
 payload += "\"name\":\""          + friendlyName + "\",";
 payload += "\"command_topic\":\""+ commandTopic  + "\",";
 payload += "\"state_topic\":\""  + stateTopic    + "\",";
 payload += "\"payload_on\":\""   + payloadOn     + "\",";
 payload += "\"payload_off\":\""  + payloadOff    + "\",";
 payload += "\"state_on\":\"ON\",\"state_off\":\"OFF\",";
 payload += "\"availability_topic\":\"" + deviceId + "/status\",";                            // Entity shows 'unavailable' when the clock is offline (Last Will)
 payload += "\"unique_id\":\""     + uniqueId      + "\",";
 payload += "\"device\":{";
 payload +=   "\"identifiers\":[\"" + deviceId + "\"],";
 payload +=   "\"name\":\""         + String(Mem.BLEbroadcastName) + "\",";
 payload +=   "\"manufacturer\":\"EdNieuw\",";
 payload +=   "\"model\":\"WordClock\"";
 payload += "}}";

 bool ok = MQTTclient.publish(configTopic.c_str(), payload.c_str(), true);
 Tekstprintlnf("[MQTT] Discovery publish %s (%u bytes): %s", ok ? "OK" : "FAILED - packet too big for MQTT buffer?", payload.length(), configTopic.c_str());
}

//--------------------------------------------                                                //
// MQTT Generic helper: publishes one MQTT Discovery config for a number (slider).
// commandTemplate wraps the slider value in an existing menu command, e.g. "M{{ value }}"
// makes HA publish "M200", which goes straight into ReworkInputString().
//--------------------------------------------
void publishDiscoveryNumber(String deviceId, String numberKey, String friendlyName, String commandTopic, String stateTopic, int minVal, int maxVal, String commandTemplate)
{
 String configTopic = "homeassistant/number/" + deviceId + "/" + numberKey + "/config";
 String uniqueId    = deviceId + "_" + numberKey;

 String payload  = "{";
 payload += "\"name\":\""             + friendlyName    + "\",";
 payload += "\"command_topic\":\""   + commandTopic    + "\",";
 payload += "\"state_topic\":\""     + stateTopic      + "\",";
 payload += "\"command_template\":\""+ commandTemplate + "\",";
 payload += "\"min\":" + String(minVal) + ",\"max\":" + String(maxVal) + ",\"step\":1,";
 payload += "\"availability_topic\":\"" + deviceId + "/status\",";                            // Entity shows 'unavailable' when the clock is offline (Last Will)
 payload += "\"unique_id\":\""        + uniqueId        + "\",";
 payload += "\"device\":{";
 payload +=   "\"identifiers\":[\"" + deviceId + "\"],";
 payload +=   "\"name\":\""         + String(Mem.BLEbroadcastName) + "\",";
 payload +=   "\"manufacturer\":\"EdNieuw\",";
 payload +=   "\"model\":\"WordClock\"";
 payload += "}}";

 bool ok = MQTTclient.publish(configTopic.c_str(), payload.c_str(), true);
 Tekstprintlnf("[MQTT] Discovery publish %s (%u bytes): %s", ok ? "OK" : "FAILED - packet too big for MQTT buffer?", payload.length(), configTopic.c_str());
}

//--------------------------------------------                                                //
// MQTT Publish the states of all switches, selects, numbers and diagnostic sensors.
// Called once per minute from EveryMinuteUpdate(), after every MQTT command (instant feedback
// in HA) and right after (re)connecting so no entity stays 'unknown'.
//--------------------------------------------
void PublishMQTTStates(void)
{
 if (!MQTTclient.connected()) return;
 String base = MQTTDeviceId();
 char buf[16];
 MQTTclient.publish((base + "/display").c_str(), LEDsAreOff ? "OFF" : "ON", true);
 MQTTclient.publish((base + "/randomdisplay").c_str(), RandomChoiceNames[_min(Mem.RandomDisplay, (byte)2)], true);
 itoa(Mem.UpperBrightness, buf, 10);        MQTTclient.publish((base + "/maxbrightness").c_str(), buf, true);
 itoa((int)WiFi.RSSI(), buf, 10);           MQTTclient.publish((base + "/rssi").c_str(),          buf, true);
 ultoa(millis() / 60000UL, buf, 10);        MQTTclient.publish((base + "/uptime").c_str(),        buf, true);
 ultoa(ESP.getFreeHeap(), buf, 10);         MQTTclient.publish((base + "/freeheap").c_str(),      buf, true);
 itoa(Mem.MCUrestarted, buf, 10);           MQTTclient.publish((base + "/mcurestarts").c_str(),   buf, true);
 itoa(Mem.WIFInoConnection, buf, 10);       MQTTclient.publish((base + "/wifireboots").c_str(),   buf, true);
 itoa(Mem.LoopRebooted, buf, 10);           MQTTclient.publish((base + "/looprestarts").c_str(),  buf, true);
 if (DS3231Installed)
   { dtostrf(RTCklok.getTemperature(), 4, 1, buf); MQTTclient.publish((base + "/ds3231temp").c_str(), buf, true); }
}

//--------------------------------------------                                                //
// MQTT TEST: publish the current Display Colour Scheme (QchoiceNames[Mem.DisplayChoice]) so the HA
// select entity shows the right value. Called every minute from EveryMinuteUpdate() - DisplayChoice
// can also change from BLE/Serial/the web page/IR remote, so this keeps HA in sync without hooking every call site.
//--------------------------------------------
void PublishDisplayChoiceState(void)
{
 if (!MQTTclient.connected()) return;
 byte dp = _min(Mem.DisplayChoice, LASTITEM);
 MQTTclient.publish((MQTTDeviceId() + "/displaychoice").c_str(), QchoiceNames[dp], true);
}

//--------------------------------------------                                                //
// MQTT Incoming command callback - forwards the raw payload into the existing single-letter
// command parser (ReworkInputString), the same one BLE/Serial/the web page already use.
// A payload matching one of QchoiceNames[] (from the HA select entity) is translated to "Qn" first.
//--------------------------------------------
void MQTTCallback(char* topic, byte* payload, unsigned int length)
{
 if (length == 0 || length > 40) return;                                                     // ReworkInputString() itself caps input at 40 chars
 char buf[41];
 memcpy(buf, payload, length);
 buf[length] = 0;
 Tekstprintlnf("[MQTT] Command received on %s: %s", topic, buf);

 for (byte i = 0; i <= LASTITEM; i++)                                                         // Is this a Display Colour Scheme name from the HA select?
   {
    if (strcmp(buf, QchoiceNames[i]) == 0) { ReworkInputString(String("Q") + i); PublishMQTTStates(); PublishDisplayChoiceState(); return; }
   }
 for (byte i = 0; i < 3; i++)                                                                 // Is this a Random Display name from the HA select?
   {
    if (strcmp(buf, RandomChoiceNames[i]) == 0) { ReworkInputString(String("~") + i); PublishMQTTStates(); PublishDisplayChoiceState(); return; }
   }
 ReworkInputString(String(buf));
 PublishMQTTStates();                                                                         // Report the new states back so HA switches/selects update instantly
 PublishDisplayChoiceState();
}

//--------------------------------------------                                                //
// MQTT Generic helper: publishes one MQTT Discovery config for a sensor
//--------------------------------------------
void publishDiscoverySensor(String deviceId, String sensorKey, String friendlyName, String stateTopic, String unit, String deviceClass, bool diagnostic)
{
 String configTopic = "homeassistant/sensor/" + deviceId + "/" + sensorKey + "/config";
 String uniqueId    = deviceId + "_" + sensorKey;

 String payload  = "{";                                                                       // Build JSON payload manually (small enough not to need ArduinoJson here)
 payload += "\"name\":\""                + friendlyName + "\",";
 payload += "\"state_topic\":\""         + stateTopic   + "\",";
 if (unit.length())        payload += "\"unit_of_measurement\":\"" + unit        + "\",";    // Omit when empty - HA rejects an empty device_class/unit
 if (deviceClass.length()) payload += "\"device_class\":\""        + deviceClass + "\",";
 if (diagnostic)           payload += "\"entity_category\":\"diagnostic\",";                  // Shown in HA's Diagnostic section instead of Sensors
 payload += "\"availability_topic\":\""  + deviceId     + "/status\",";                       // Entity shows 'unavailable' when the clock is offline (Last Will)
 payload += "\"state_class\":\"measurement\",";
 payload += "\"unique_id\":\""           + uniqueId     + "\",";
 payload += "\"device\":{";
 payload +=   "\"identifiers\":[\"" + deviceId + "\"],";
 payload +=   "\"name\":\""         + String(Mem.BLEbroadcastName) + "\",";
 payload +=   "\"manufacturer\":\"EdNieuw\",";
 payload +=   "\"model\":\"WordClock\"";
 payload += "}}";

 bool ok = MQTTclient.publish(configTopic.c_str(), payload.c_str(), true);                     // Retain = true, so HA sees it immediately on restart without waiting for a republish
 Tekstprintlnf("[MQTT] Discovery publish %s (%u bytes): %s", ok ? "OK" : "FAILED - packet too big for MQTT buffer?", payload.length(), configTopic.c_str());
}

//--------------------------------------------                                                //
// MQTT TEST: publish the ESP32 internal CPU temperature. Called every minute from EveryMinuteUpdate()
//--------------------------------------------
void PublishCPUTemperature(void)
{
 if (!MQTTclient.connected()) return;
 char cpuTempStr[8];
 dtostrf(temperatureRead(), 4, 1, cpuTempStr);                                                // ESP32 internal temperature sensor, degrees Celsius
 MQTTclient.publish((MQTTDeviceId() + "/cputemp").c_str(), cpuTempStr);
}

//--------------------------------------------                                                //
// MQTT TEST: publish the LDR (light sensor) reading. Called every second from EverySecondCheck()
//--------------------------------------------
void PublishLDRreading(void)
{
 if (!MQTTclient.connected()) return;
 char ldrStr[8];
 itoa(Previous_LDR_read, ldrStr, 10);
 MQTTclient.publish((MQTTDeviceId() + "/ldr").c_str(), ldrStr);
}

//--------------------------------------------                                                //
// NTP Notify
//--------------------------------------------
void NTPnotify(struct timeval* tv) { ntpJustSynced = true; }                                  // --- NTP time synchronized --- is printed later
//--------------------------------------------                                                //
// NTP Check and Print NTP if synced
//--------------------------------------------
void CheckandPrintNTPsynced(void)
{
 struct tm tm;
 time_t now = time(nullptr);
 localtime_r(&now, &tm); 
 if (Mem.TimeLogPrint != 0 )                                              // Do not print time but do update the display                                                              // do not Print the time string every minute
   { 
    Tekstprintlnf("-- NTP time synchronized --  %02d-%s-%04d %02d:%02d:%02d ",
           timeinfo.tm_mday,  monthNames[timeinfo.tm_mon],   // tm_mon is 0–11
           timeinfo.tm_year + 1900, timeinfo.tm_hour,
           timeinfo.tm_min,          timeinfo.tm_sec);
   }       
 ntpJustSynced = false;
}
//--------------------------------------------                                                //
// NTP Set time zone
//--------------------------------------------
void setTimezone(void) { setenv("TZ", Mem.Timezone, 1);  tzset(); }
//--------------------------------------------                                                //
// NTP Init NTP
//--------------------------------------------
void initSNTP(void) 
{  
 sntp_set_time_sync_notification_cb(NTPnotify);                                               // Optional: callback when time syncs
 configTime(0, 0, "pool.ntp.org", "time.nist.gov");                                           // 1 hour sync interval = default
 setTimezone();                                                                               // Must be set after configTime
}
//--------------------------------------------                                                //
// NTP Get a NTP time and wait max 2.5 sec 
//--------------------------------------------
bool wait4SNTP(void) 
{
 int32_t Tick = millis(); 
 bool SNTPtimeValid = true;
 while (sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) 
  { if ((millis() - Tick) >2500) {SNTPtimeValid = false; break;}   }                          // Wait max 2.5 seconds 
return  SNTPtimeValid;
}

//--------------------------------------------                                                //
// WIFI Check for a Pending command received from the web page 
// Log SWversion to web page when Log = true
//--------------------------------------------
void BuildHTMLPage(bool Log)
{
 int i = 0;
 html_info[0] = 0;
 DoNotLog = !Log;
 SWversion();
 DoNotLog = false;
 
 size_t topLen    = strlen(index_html_top);
 size_t infoLen   = strlen(html_info);
 size_t footerLen = strlen(index_html_footer);
 size_t totalLen  = topLen + infoLen + footerLen;
 
 if (totalLen >= MAXSIZE_HTML_PAGE)
   {
    snprintf(HTML_page, MAXSIZE_HTML_PAGE,
             "%s<br>Send I for menu\n*** INCREASE MAXSIZE_HTML_PAGE (need %u) ***<br>",
             index_html_top, (unsigned)totalLen);
    return;
   }
 
 memcpy(HTML_page + i, index_html_top,    topLen);     i += topLen;
 memcpy(HTML_page + i, html_info,         infoLen);    i += infoLen;
 memcpy(HTML_page + i, index_html_footer, footerLen);  i += footerLen;
 HTML_page[i] = 0;
}

//--------------------------------------------                                                //
// WIFI CheckWIFIcommand
//--------------------------------------------
void CheckWIFIcommand(void)
{
 if (PendingCommand.length() > 0)
  {
   ReworkInputString(PendingCommand);
   BuildHTMLPage(false);                                                                      // Rebuild page after command; no logging (only i/ii should log the menu) 
  }
}
//--------------------------------------------                                                //
// WIFI WEBPAGE
//--------------------------------------------
void WebPage(void)
{
 BuildHTMLPage(true);                                                                         // Build initial page at startup with logging enabled
 server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)                                  // Send web page with input fields to client
   {  request->send(200, "text/html",(const char*) HTML_page  );  }    ); 
 server.on("/log", HTTP_GET, [](AsyncWebServerRequest *request)                               // Serve the log viewer HTML page
   {  request->send(200, "text/html", logData);    });                                        // Serve the HTML page from LogViewer.h
 server.on("/tekstprint",  HTTP_GET, HandleTekstPrint);                                       // LOGBUFFER Printlast 500 lines
 server.on("/tekstdownload", HTTP_GET, HandleTekstDownload);                                  // LOGBUFFER Stream all the circular log buffer directly to the client
#if defined(WORDCLOCK) || defined(FIBONACCI)
 server.on("/colourpick", HTTP_GET, [](AsyncWebServerRequest *request)
  {
  String page = ColourPick_html;
  char buf[12];
  page.replace("%%CNAME%%", Mem.BLEbroadcastName);                                            // Page title = broadcast name
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourNL);     page.replace("%%COLNL%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourDE);     page.replace("%%COLDE%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourFR);     page.replace("%%COLFR%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.ColourUK);     page.replace("%%COLUK%%", buf);
  snprintf(buf, sizeof(buf), "%08" PRIX32, Mem.DimmedLetter); page.replace("%%COLBG%%", buf);
  request->send(200, "text/html", page);
  });
#endif   // colour picker (WordClock + Fibonacci)
#if defined(WORDCLOCK) || defined(FIBONACCI)
 server.on("/menu", HTTP_GET, [](AsyncWebServerRequest *request)                              // Serve the settings menu page
   {  request->send(200, "text/html", menu_html);  });
#endif   // settings menu (WordClock + Fibonacci)

 server.on("/menustate", HTTP_GET, [](AsyncWebServerRequest *request)                         // Return current Mem toggle states as JSON
  {
   char json[512];
#if defined(FIBONACCI)
   byte dp = _min(Mem.DisplayChoice, LASTITEM);  // Selected palette row - used below for the 3 live swatch colours
   snprintf(json, sizeof(json),
     "{\"tf\":%d,\"t2\":%d,\"t3\":%d,\"t5\":%d,\"t8\":%d,\"tj\":%d,\"t9\":%d,"
     "\"hi\":\"h0%d\",\"qval\":%d,\"sval\":%d,\"lval\":%d,\"mval\":%d,"
     "\"noff\":%d,\"non\":%d,\"ds3231hw\":%d,\"rtcsrc\":\"%s\",\"kldr\":%d,\"kmin\":%d,\"khour\":%d,\"koff\":%d,\"cname\":\"%s\","
     "\"lc1\":\"%08" PRIX32 "\",\"lc2\":\"%08" PRIX32 "\",\"lc3\":\"%08" PRIX32 "\"}",
     Mem.FiboChrono   ? 1 : 0,  // tf F  Fibonacci display
     LEDsAreOff       ? 0 : 1,  // t2 O
     Mem.StatusLEDOn  ? 1 : 0,  // t3 P
     Mem.NTPOn        ? 1 : 0,  // t5 X
     Mem.Ringbufcnt   ? 1 : 0,  // t8 }
     Mem.UseDS3231    ? 1 : 0,  // tj J
     Mem.TimeReceiver ? 1 : 0,  // t9 H05
     (int)Mem.TimeInput,        // hi h00-h04
     (int)Mem.DisplayChoice,    // qval Q0-Q9
     (int)Mem.LightReducer,     // sval S
     (int)Mem.LowerBrightness,  // lval L
     (int)Mem.UpperBrightness,  // mval M
     (int)Mem.TurnOffLEDsAtHH,  // noff N off-hour
     (int)Mem.TurnOnLEDsAtHH,   // non  N on-hour
     DS3231Installed  ? 1 : 0,  // ds3231hw
     (Mem.UseDS3231 && DS3231Installed) ? "DS3231" : (Mem.NTPOn ? "NTP" : "ESP32"),
     TestLDR              ? 1 : 0,  // kldr K  (LDR test)
     Mem.TimeLogPrint==1  ? 1 : 0,  // kmin K1 (log per minute)
     Mem.TimeLogPrint==2  ? 1 : 0,  // khour K2 (log per hour)
     Mem.TimeLogPrint==0  ? 1 : 0,  // koff K0 (logging off)
     Mem.BLEbroadcastName,          // cname shown as page title
     colors[dp][1],                 // lc1 hours colour  - swatch 1
     colors[dp][2],                 // lc2 minutes colour - swatch 2
     colors[dp][3]);                // lc3 both colour   - swatch 3
#else   // WORDCLOCK
   snprintf(json, sizeof(json),
     "{\"t0\":%d,\"t1\":%d,\"t2\":%d,\"t3\":%d,\"t5\":%d,\"t8\":%d,"
     "\"tj\":%d,\"tself\":%d,\"tdemo\":%d,\"t9\":%d,"
     "\"hi\":\"h0%d\",\"qval\":%d,"
     "\"sval\":%d,\"lval\":%d,\"mval\":%d,"
     "\"noff\":%d,\"non\":%d,"
     "\"ds3231hw\":%d,\"rtcsrc\":\"%s\",\"kldr\":%d,\"kmin\":%d,\"khour\":%d,\"koff\":%d,\"cname\":\"%s\",\"lc\":\"%08" PRIX32 "\"}",
     Mem.HetIsWasOff      ? 0 : 1,  // t0 )  HET IS WAS ON when HetIsWasOff==0
     Mem.EdSoftLEDSOn     ? 1 : 0,  // t1 (
     LEDsAreOff           ? 0 : 1,  // t2 O  ON when display is on
     Mem.StatusLEDOn      ? 1 : 0,  // t3 P
     Mem.NTPOn            ? 1 : 0,  // t5 X
     Mem.Ringbufcnt       ? 1 : 0,  // t8 }
     Mem.UseDS3231        ? 1 : 0,  // tj J
     Zelftest             ? 1 : 0,  // tself #
     Demo                 ? 1 : 0,  // tdemo U
     Mem.TimeReceiver     ? 1 : 0,  // t9 H05
     (int)Mem.TimeInput,            // hi  h00-h04
     (int)Mem.DisplayChoice,        // qval Q0-Q8
     (int)Mem.LightReducer,         // sval S
     (int)Mem.LowerBrightness,      // lval L
     (int)Mem.UpperBrightness,      // mval M
     (int)Mem.TurnOffLEDsAtHH,      // noff N off-hour
     (int)Mem.TurnOnLEDsAtHH,       // non  N on-hour
     DS3231Installed      ? 1 : 0,  // ds3231hw hardware present
     (Mem.UseDS3231 && DS3231Installed) ? "DS3231" :
       (Mem.NTPOn ? "NTP" : "ESP32"), // rtcsrc active time source
     TestLDR              ? 1 : 0,  // kldr K  (LDR test)
     Mem.TimeLogPrint==1  ? 1 : 0,  // kmin K1 (log per minute)
     Mem.TimeLogPrint==2  ? 1 : 0,  // khour K2 (log per hour)
     Mem.TimeLogPrint==0  ? 1 : 0,  // koff K0 (logging off)
     Mem.BLEbroadcastName,          // cname shown as page title
     LetterColor                    // lc live LED colour, swatch beside the Q slider
   );
#endif
   request->send(200, "application/json", json);
  });

 server.on("/get", HTTP_GET, [] (AsyncWebServerRequest *request)
   {
    String inputMessage;
    if (request->hasParam(PARAM_INPUT_1)) {inputMessage = request->getParam(PARAM_INPUT_1)->value();}
    PendingCommand = inputMessage;                                                            //  Command → queue it and redirect
    request->redirect("/wait");
});

